package a1026;

/*
 	대입연산자
 	=, +=, -=, *=, /=, %=
 	<<=, >>=, >>>=,
 	&=, |=, ^=
 
 */

public class Operator7 {

	public static void main(String[] args) {
		
		int i = 3; //순수 대입
		//산술 대입
		i += 3; // i = i + 3;
		i -= 2; // i = i - 2;
		i *= 3; // i = i * 3;
		i /= 5; // i = i / 5;
		i %= 3; // i = i % 3;
		
		// 쉬프트 대입
		i <<=  4; // i = i <<4; //0000 0010 << 4 = 0010 0000
		i >>= 2; //  i =>> 2;  //0010 0000 >> 2 = 0000 1000
		i >>>= 3; // i = i >>> 3; // 0000 1000 >>> 3 = 0000 0001
		
		
		//비트 논리대입
		i &= 15; // i = i & 15; // 0000 0001 & 0000 1111 = 0000 0001
		i |= 9; // i= i|9; // 0000 0001 | 0000 1001 = 0000 1001
		i ^= 6; // i = i ^6; // 0000 1001 ^ 0000 0110 = 0000 1111
		
		System.out.println("i = " + i);

		
		System.out.println("------------------------------");
		
		int j = 10; // j는 양수 또는 음수가 들어갈 수 있다.
		//j 변수의 절대값을 출력하는 코드를 작성
		
		System.out.println(j + "의 절대값:" + (j >= 0 ? j : -j));
		
		char c = 'ㄱ'; // 12593
		// 00FF 0000 0000 0000 0000 1111 1111 1111 1111
		System.out.println(c + "의 하위 1byte 값: " + ( c & 0x00FF) + " / 상위 1byte 값" + (c & 0xFF00));
		
		
	}
}
